In [29]:
# Quiz from https://olympus.greatlearning.in/courses/40606/quizzes/153008?module_item_id=1399307

In [30]:
import warnings
warnings.filterwarnings('ignore')
%config Completer.use_jedi = False

In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [32]:
a = ['x', 'y', 'z']
b = ['w']
a.append(b)
print(a)

['x', 'y', 'z', ['w']]

In [34]:
a=('x','y','z')
a[0]='t'
print(a)

TypeError: 'tuple' object does not support item assignment

In [35]:
x=1 
for i in range (1,10,2):
    print(x*i)

1
3
5
7
9

In [36]:
 a = np.array([['m', '2'],['n','3']])

In [37]:
a

array([['m', '2'],
       ['n', '3']], dtype='<U1')

In [38]:
a[0,1]

'2'

In [39]:
df = pd.read_csv('Dateset_ODI.csv')

In [40]:
dataset.head()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [41]:
dataset.tail()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
3927,ODI # 3928,India,New Zealand,New Zealand,6 wickets,Mumbai,"Oct 22, 2017"
3928,ODI # 3929,South Africa,Bangladesh,South Africa,200 runs,East London,"Oct 22, 2017"
3929,ODI # 3930,Pakistan,Sri Lanka,Pakistan,9 wickets,Sharjah,"Oct 23, 2017"
3930,ODI # 3931,India,New Zealand,India,6 wickets,Pune,"Oct 25, 2017"
3931,ODI # 3932,India,New Zealand,India,6 runs,Kanpur,"Oct 29, 2017"

In [42]:
# On which ground are the maximum number of matches played?
df['Ground'].value_counts()

Sharjah       228
Dhaka         156
Sydney        154
Melbourne     147
Harare        136
             ...
Vijayawada      1
Mackay          1
Whangarei       1
Berri           1
Albury          1
Name: Ground, Length: 173, dtype: int64

In [43]:
# Which team won maximum matches on Ground ‘ Sharjah’ ?
df1 = df[df['Ground'] == 'Sharjah']
df1['Winner'].value_counts()

Pakistan        83
India           35
Sri Lanka       29
West Indies     19
Australia       14
South Africa    10
Afghanistan      9
New Zealand      9
England          8
Zimbabwe         8
tied             2
Canada           1
Netherlands      1
Name: Winner, dtype: int64

In [28]:
#On which date exactly 6 matches were played?
df['Match Date'].value_counts()

Feb 4, 2007     6
Jun 20, 1983    4
Jun 13, 1983    4
Jun 7, 1975     4
Jan 31, 2007    4
               ..
May 19, 2017    1
Nov 28, 2008    1
Nov 10, 2003    1
Apr 3, 1990     1
Dec 4, 1985     1
Name: Match Date, Length: 3386, dtype: int64

In [44]:
#On which ground did Australia win the most number of matches?
df1 = df[df['Winner'] == 'Australia']  
df1['Ground'].value_counts()

Sydney        85
Melbourne     74
Adelaide      34
Perth         29
Brisbane      23
              ..
Chittagong     1
Chandigarh     1
Karachi        1
Georgetown     1
Faridabad      1
Name: Ground, Length: 97, dtype: int64

In [45]:
#How many times team 2 won?
(df['Team 2'] == df['Winner']).sum()

1637

In [46]:
#Which team won the most matches on Lord’s Ground?
df1 = df[df['Ground'] == "Lord's"]   
df1['Winner'].value_counts()

England         23
Australia       12
West Indies      6
Pakistan         4
India            4
Sri Lanka        4
New Zealand      3
tied             2
South Africa     1
no result        1
Name: Winner, dtype: int64